In [110]:
import pandas as pd

# 01- How to find version

In [111]:
# Check pandas version
pd.__version__

'2.3.1'

In [112]:
# Another way to show pandas verison 
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : c888af6d0bb674932007623c0867e1fbd4bdc2c6
python                : 3.13.5
python-bits           : 64
OS                    : Darwin
OS-release            : 20.6.0
Version               : Darwin Kernel Version 20.6.0: Thu Jul  6 22:12:47 PDT 2023; root:xnu-7195.141.49.702.12~1/RELEASE_X86_64
machine               : x86_64
processor             : i386
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : None.UTF-8

pandas                : 2.3.1
numpy                 : 2.3.1
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 25.1
Cython                : None
sphinx                : None
IPython               : 9.4.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : None
lxml.etree            : None
matplotlib            : 3.10.3
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.2
qtpy                  : None
pyqt5                 : None

 
# 02- Make a DataFrame

In [113]:
df = pd.DataFrame({'Col A':[ 1,2,3], "Col B": [4,5,6]})
df

   Col A  Col B
0      1      4
1      2      5
2      3      6

In [114]:
# Array conversion to DataFrame
import numpy as np
array = np.array([[1,2,3], [4,5,6], [7,8,9]])
array

df = pd.DataFrame(array)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [115]:
# Creating a DataFrame with random floats 
df = pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))
df

,A,B,C,D,E,F,G,H
0,0.305849,0.889791,0.868382,0.187355,0.642086,0.816959,0.831437,0.565525
1,0.802397,0.848916,0.153401,0.501168,0.139738,0.278354,0.193159,0.786407
2,0.263687,0.290958,0.727573,0.182338,0.176626,0.395985,0.431989,0.668436
3,0.600586,0.994960,0.381282,0.913542,0.162851,0.918132,0.763045,0.904683

# 03- How to rename a columns?

In [116]:
# Creating a DataFrame with random integers and specific index and columns with names
df = pd.DataFrame(np.random.randint(1,11,size=(4,8))
                  ,columns=list("ABCDEFGH")
                  , index=['R1', 'R2', 'R3', 'R4'])
df

    A  B   C  D  E  F  G  H
R1  8  7   4  3  4  1  5  2
R2  3  1   8  7  9  6  8  5
R3  8  6  10  6  2  3  1  3
R4  4  8   3  7  1  2  2  9

In [117]:
df = pd.DataFrame(np.random.randint(1,21, size = (3,3)))
df

    0   1   2
0   2  19   8
1  16  19   8
2   3   3  17

In [118]:
# Change colums name
df.columns=['col1', 'col2','col3']
df

   col1  col2  col3
0     2    19     8
1    16    19     8
2     3     3    17

In [119]:
# Change rows name
df.index=["Row-1", "Row-2", "Row-3"]
df

       col1  col2  col3
Row-1     2    19     8
Row-2    16    19     8
Row-3     3     3    17

In [120]:
# to replace any charactor or string
df.columns = df.columns.str.replace("-","_")

df

       col1  col2  col3
Row-1     2    19     8
Row-2    16    19     8
Row-3     3     3    17

In [121]:
# adding perfix in columns
df = df.add_prefix("A_")
df

       A_col1  A_col2  A_col3
Row-1       2      19       8
Row-2      16      19       8
Row-3       3       3      17

In [122]:
# adding suffix in columns
df = df.add_suffix("_X")
df

       A_col1_X  A_col2_X  A_col3_X
Row-1         2        19         8
Row-2        16        19         8
Row-3         3         3        17

In [123]:
df.columns=["col-1", "col-2", 'col-3']
df

       col-1  col-2  col-3
Row-1      2     19      8
Row-2     16     19      8
Row-3      3      3     17

# 04- Using tamplate data

In [124]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [125]:
# summary
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [126]:
# columns name
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [127]:
# rows count
df.index

RangeIndex(start=0, stop=891, step=1)

In [128]:
# save DataFrame to CSV
df.to_csv("zyx.csv")

In [129]:
# converted to excel
df.to_excel("xyz.xlsx")
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

# 05- Using your own data

In [130]:
# read from excel
df = pd.read_csv("zyx.csv")
df

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True